/*
 * Project:        RMPS
 * Compiler:       JDK1.6.0
 * CopyRight:      &copy; 2007 Amon &reg; Winshine ( Amon@amonsoft.cn / http://amonsoft.cn ).
 * Description:
 *
 */
package cons.amon.lang.A3010000;

import cons.SysCons;
import cons.id.AmonCons;

/**
 * <ul>
 * <li>功能说明：</li>
 * <br />
 * TODO: 功能说明
 * <li>使用说明：</li>
 * <br />
 * TODO: 使用说明
 * </ul>
 * @author Amon
 */
public interface ConstUI
{
    // ////////////////////////////////////////////////////////////////////////
    // 系统唯一标记
    // ////////////////////////////////////////////////////////////////////////
    /** 软件版本 */
    String VER_CODE = "1.0.0.0";
    /** 软件首页 */
    String URL_SOFT = SysCons.HOMEPAGE + "soft/soft0001.aspx?sid=" + AmonCons.A3010000_S;
    /** 电子邮件 */
    String URL_MAIL = SysCons.MAILADDR;
    // ////////////////////////////////////////////////////////////////////////
    // 语言配置标记
    // ////////////////////////////////////////////////////////////////////////
    /** 软件语言资源标记 */
    String RES_NAME = "A3010000";
    /** 软件标题语言资源标记 */
    String RES_TITLE = "A3010000.title";
    /** 软件描述信息语言资源标记 */
    String RES_DESCRIPTION = "A3010000.description";
    // ////////////////////////////////////////////////////////////////////////
    // 用户配置标记
    // ////////////////////////////////////////////////////////////////////////
    /** 软件配置数据 */
    String CFG_SOFT = "A3010000.soft";
    // ////////////////////////////////////////////////////////////////////////
    // 语言资源文件标记
    // ////////////////////////////////////////////////////////////////////////
    /** 模块标记 */
    String COMMENT_M_SIGN = "# ====================================================================";
    /** 模块说明 */
    String COMMENT_M_DESP = "# {0} {1}";
    /** 片段标记 */
    String COMMENT_F_SIGN = "# ----------------------------------------------------------";
    /** 片段说明 */
    String COMMENT_F_DESP = "# {0} {1}";
    /** 行标记 */
    String COMMENT_L_SIGN = "=";
    // ////////////////////////////////////////////////////////////////////////
    // Java资源文件标记
    // ////////////////////////////////////////////////////////////////////////
    String LANGRES_M_SIGN = "    // ========================================================================";
    String LANGRES_M_DESP = "    // {0} {1}";
    String LANGRES_F_SIGN = "    // ----------------------------------------------------";
    String LANGRES_F_DESP = "    // {0} {1}";
    /** 行标记 */
    String LANGRES_L_SIGN = "    String {0} = \"{0}\";//";
}
