/*
 * Project:        RMPS
 * Compiler:       JDK1.6.0
 * CopyRight:      &copy; 2007 Amon &reg; Winshine ( Amon@amonsoft.cn / http://amonsoft.cn ).
 * Description:
 *
 */
package cons.id;

/**
 * <ul>
 * <li>功能说明：</li>
 * <br />
 * PRP系统软件索引常量
 * <li>使用说明：</li>
 * <br />
 * </ul>
 * @author Amon
 */
/**
 * @author Amon
 */
public interface PrpCons
{
    // ========================================================================
    // Home模块系统常量
    // ========================================================================
    /** 默认首页系统标记 */
    int P0010000_I = 0x10010000;
    String P0010000_S = "10010000";
    // ========================================================================
    // Work模块系统常量
    // ========================================================================
    // ========================================================================
    // Musc模块系统常量
    // ========================================================================
    // ========================================================================
    // Aide模块系统常量
    // ========================================================================
    /** 后缀解析系统标记 */
    int P3010000_I = 0x13010000;
    String P3010000_S = "13010000";
    /** 文件更名系统标记 */
    int P3020000_I = 0x13020000;
    String P3020000_S = "13020000";
    /** 编码查询系统标记 */
    int P3030000_I = 0x13030000;
    String P3030000_S = "13030000";
    /** 迷你日历系统标记 */
    int P3040000_I = 0x13040000;
    String P3040000_S = "13040000";
    /** 数据安全系统标记 */
    int P3050000_I = 0x13050000;
    String P3050000_S = "13050000";
    /** 计算助理系统标记 */
    int P3060000_I = 0x13060000;
    String P3060000_S = "13060000";
    /** 网址收藏系统标记 */
    int P3070000_I = 0x13070000;
    String P3070000_S = "13070000";
    /** 迷你时钟系统标记 */
    int P3080000_I = 0x13080000;
    String P3080000_S = "13080000";
    /** 天气预报系统标记 */
    int P3090000_I = 0x13090000;
    String P3090000_S = "13090000";
    /** 飞机航班系统标记 */
    int P30A0000_I = 0x130A0000;
    String P30A0000_S = "130A0000";
    /** 列车时刻系统标记 */
    int P30B0000_I = 0x130B0000;
    String P30B0000_S = "130B0000";
    /** 列车时刻系统标记 */
    int P30C0000_I = 0x130C0000;
    String P30C0000_S = "130C0000";
    /** 列车时刻系统标记 */
    int P30D0000_I = 0x130D0000;
    String P30D0000_S = "130D0000";
    /** 列车时刻系统标记 */
    int P30E0000_I = 0x130E0000;
    String P30E0000_S = "130E0000";
    /** 列车时刻系统标记 */
    int P30F0000_I = 0x130F0000;
    String P30F0000_S = "130F0000";
    /** 示例软件系统标记 */
    int Testsoft_I = 0x13000000;
    String Testsoft_S = "13000000";
    /** 用户登录 */
    int U0000000_I = 0x80000000;
    String U0000000_S = "80000000";
    /** 用户注册 */
    int U0010000_I = 0x80010000;
    String U0010000_S = "80010000";
    /** 信息修改 */
    int U0020000_I = 0x80020000;
    String U0020000_S = "80020000";
}
