/*
 * Project:        RMPS
 * Compiler:       JDK1.6.0
 * CopyRight:      &copy; 2007 Amon &reg; Winshine ( Amon@amonsoft.cn / http://amonsoft.cn ).
 * Description:
 *
 */
package cons.prp.aide.P30F0000;

/**
 * <ul>
 * <li>功能说明：</li>
 * <br />
 * TODO: 功能说明
 * <li>使用说明：</li>
 * <br />
 * TODO: 使用说明
 * </ul>
 * 
 * @author Amon
 */
public interface LangRes
{
    // ========================================================================
    // 1 共用语言资源
    // ========================================================================
    // ----------------------------------------------------
    // 1 共用语言资源
    // ----------------------------------------------------
    String P30F1100 = "P30F1100"; // 2
    String P30F1101 = "P30F1101"; // yyyy-MM-dd hh:mm:ss
    // ----------------------------------------------------
    // 2 标题语言资源
    // ----------------------------------------------------
    String P30F1200 = "P30F1200"; // 5
    String P30F1201 = "P30F1201"; // 魔方密码
    String P30F1202 = "P30F1202"; // 用户登录
    String P30F1203 = "P30F1203"; // 口令修改
    String P30F1204 = "P30F1204"; // 用户注册
    // ----------------------------------------------------
    // B 自定义语言资源
    // ----------------------------------------------------
    String P30F1B00 = "P30F1B00"; // c
    String P30F1B01 = "P30F1B01"; // 温馨提示
    String P30F1B02 = "P30F1B02"; // 您可以使用快捷键 Ctrl+1 快速添加一个“单行文本”记录！
    String P30F1B03 = "P30F1B03"; // 您可以使用快捷键 Ctrl+2 快速添加一个“用户口令”记录！
    String P30F1B04 = "P30F1B04"; // 您可以使用快捷键 Ctrl+3 快速添加一个“链接地址”记录！
    String P30F1B05 = "P30F1B05"; // 您可以使用快捷键 Ctrl+4 快速添加一个“电子邮件”记录！
    String P30F1B06 = "P30F1B06"; // 您可以使用快捷键 Ctrl+5 快速添加一个“多行文本”记录！
    String P30F1B07 = "P30F1B07"; // 您可以使用快捷键 Ctrl+Enter 或者 Ctrl+H
    // 快速隐藏魔方密码主窗口，以防止数据被它人窃视！
    String P30F1B08 = "P30F1B08"; // 您可以使用快捷键 Ctrl+N 快速开始添加一个新的密码记录！
    String P30F1B09 = "P30F1B09"; // 您可以使用快捷键 Ctrl+S 快速保存当前查看或编辑的密码记录！
    String P30F1B0A = "P30F1B0A"; // 您可以使用快捷键 Ctrl+D 快速删除当前查看或编辑的密码记录！
    String P30F1B0B = "P30F1B0B"; // 如果您有什么意见或建议，欢迎与作者联系：登录作者网站（http://www.amonsoft.cn）或者给作者发邮件（Amonsoft@163.com）！
    // ========================================================================
    // 6 普通窗口语言资源
    // ========================================================================
    // ----------------------------------------------------
    // 1 共用语言资源
    // ----------------------------------------------------
    String P30F6100 = "P30F6100"; // 3
    String P30F6101 = "P30F6101"; // 口令类别
    String P30F6102 = "P30F6102"; // 口令名称
    // ----------------------------------------------------
    // 3 标签语言资源
    // ----------------------------------------------------
    String P30F6300 = "P30F6300"; // 15
    String P30F6301 = "P30F6301"; // 数据查询(&S)
    String P30F6302 = "P30F6302"; // 数据查询
    String P30F6303 = "P30F6303"; // 名称(&N)
    String P30F6304 = "P30F6304"; // 属性名称
    String P30F6305 = "P30F6305"; // 内容(&T)
    String P30F6306 = "P30F6306"; // 属性内容
    String P30F6307 = "P30F6307"; // 名称(&N)
    String P30F6308 = "P30F6308"; // 邮件名称
    String P30F6309 = "P30F6309"; // 地址(&T)
    String P30F630A = "P30F630A"; // 邮件地址
    String P30F630B = "P30F630B"; // 类别(&K)
    String P30F630C = "P30F630C"; // 口令类别
    String P30F630D = "P30F630D"; // 名称(&N)
    String P30F630E = "P30F630E"; // 口令名称
    String P30F630F = "P30F630F"; // 日期(&T)
    String P30F6310 = "P30F6310"; // 当前日期
    String P30F6311 = "P30F6311"; // 类别(&K)
    String P30F6312 = "P30F6312"; // 口令类别
    String P30F6313 = "P30F6313"; // 搜索(&S)
    String P30F6314 = "P30F6314"; // 关键搜索
    // ----------------------------------------------------
    // 4 文本语言资源
    // ----------------------------------------------------
    String P30F6400 = "P30F6400"; // 3
    String P30F6401 = "P30F6401"; //
    String P30F6402 = "P30F6402"; // 您要查询的内容
    // ----------------------------------------------------
    // 5 按钮语言资源
    // ----------------------------------------------------
    String P30F6500 = "P30F6500"; // 19
    String P30F6501 = "P30F6501"; // 查询(&Q)
    String P30F6502 = "P30F6502"; // 查询
    String P30F6503 = "P30F6503"; // 选单(&M)
    String P30F6504 = "P30F6504"; // 系统选单
    String P30F6505 = "P30F6505"; // &P
    String P30F6506 = "P30F6506"; // 向上移动
    String P30F6507 = "P30F6507"; // &N
    String P30F6508 = "P30F6508"; // 向下移动
    String P30F6509 = "P30F6509"; // &C
    String P30F650A = "P30F650A"; // 复制
    String P30F650B = "P30F650B"; // &U
    String P30F650C = "P30F650C"; // 更新
    String P30F650D = "P30F650D"; // &D
    String P30F650E = "P30F650E"; // 删除
    String P30F650F = "P30F650F"; // &G
    String P30F6510 = "P30F6510"; // 生成随机口令
    String P30F6511 = "P30F6511"; // &B
    String P30F6512 = "P30F6512"; // 打开链接地址
    String P30F6513 = "P30F6513"; // 显示口令
    String P30F6514 = "P30F6514"; // 隐藏口令
    String P30F6515 = "P30F6515"; // &E
    String P30F6516 = "P30F6516"; // 发送电子邮件
    String P30F6517 = "P30F6517"; // &K
    String P30F6518 = "P30F6518"; // 配置口令生成参数
    // ----------------------------------------------------
    // 6 菜单语言资源
    // ----------------------------------------------------
    String P30F6600 = "P30F6600"; // 2f
    String P30F6601 = "P30F6601"; // 新增数据(&N)
    String P30F6602 = "P30F6602"; // 新增口令数据
    String P30F6603 = "P30F6603"; // 保存数据(&S)
    String P30F6604 = "P30F6604"; // 保存口令数据
    String P30F6605 = "P30F6605"; // 删除数据(&D)
    String P30F6606 = "P30F6606"; // 删除口令数据
    String P30F6607 = "P30F6607"; // 添加单行文本(&1)
    String P30F6608 = "P30F6608"; // 添加用户口令(&2)
    String P30F6609 = "P30F6609"; // 添加链接地址(&3)
    String P30F660A = "P30F660A"; // 添加多行文本(&5)
    String P30F660B = "P30F660B"; // 更改口令(&C)
    String P30F660C = "P30F660C"; // 更改用户登录口令
    String P30F660D = "P30F660D"; // 退出(&X)
    String P30F660E = "P30F660E"; // 退出系统
    String P30F660F = "P30F660F"; // 新增类别
    String P30F6610 = "P30F6610"; // 新增类别
    String P30F6611 = "P30F6611"; // 更新类别
    String P30F6612 = "P30F6612"; // 更新类别
    String P30F6613 = "P30F6613"; // 删除类别
    String P30F6614 = "P30F6614"; // 删除类别
    String P30F6615 = "P30F6615"; // 隐藏窗口(&H)
    String P30F6616 = "P30F6616"; // 隐藏窗口
    String P30F6617 = "P30F6617"; // 清除记录历史(&H)
    String P30F6618 = "P30F6618"; // 清除单个口令的历史记录
    String P30F6619 = "P30F6619"; // 添加电子邮件(&4)
    String P30F661A = "P30F661A"; // 口令长度(&L)
    String P30F661B = "P30F661B"; // 口令长度
    String P30F661C = "P30F661C"; // 口令空间(&S)
    String P30F661D = "P30F661D"; // 口令空间
    String P30F661E = "P30F661E"; // 无重复字符
    String P30F661F = "P30F661F"; // 生成口令中不存在相同字符
    String P30F6620 = "P30F6620"; // 默认
    String P30F6621 = "P30F6621"; // 默认口令长度
    String P30F6622 = "P30F6622"; // 其它...
    String P30F6623 = "P30F6623"; // 其它口令长度
    String P30F6624 = "P30F6624"; // 数字
    String P30F6625 = "P30F6625"; // 小写字母
    String P30F6626 = "P30F6626"; // 大写字母
    String P30F6627 = "P30F6627"; // 特殊字符
    String P30F6628 = "P30F6628"; // 大小写字母
    String P30F6629 = "P30F6629"; // 字母及数字
    String P30F662A = "P30F662A"; // 可输入字符
    String P30F662B = "P30F662B"; // 设置...
    String P30F662C = "P30F662C"; // 位
    String P30F662D = "P30F662D"; // 查看历史记录
    String P30F662E = "P30F662E"; // 查看历史记录
    // ----------------------------------------------------
    // 8 复选框语言资源
    // ----------------------------------------------------
    String P30F6800 = "P30F6800"; // 5
    String P30F6801 = "P30F6801"; // 记录更新历史(&H)
    String P30F6802 = "P30F6802"; // 记录每一次的更新历史，有助于您以后的数据分析
    String P30F6803 = "P30F6803"; // 记录更新历史(&H)
    String P30F6804 = "P30F6804"; // 记录更新历史
    // ----------------------------------------------------
    // 9 其它组件语言资源
    // ----------------------------------------------------
    String P30F6900 = "P30F6900"; // 2
    String P30F6901 = "P30F6901"; // 用户属性
    // ----------------------------------------------------
    // A 消息提示语言资源
    // ----------------------------------------------------
    String P30F6A00 = "P30F6A00"; // 22
    String P30F6A01 = "P30F6A01"; // 您的数据已修改但未保存，要保存么？
    String P30F6A02 = "P30F6A02"; // 请输入您要查询的口令名称或查询关键字！
    String P30F6A03 = "P30F6A03"; // 请选择您要删除的数据！
    String P30F6A04 = "P30F6A04"; // 请选择数据类别！
    String P30F6A05 = "P30F6A05"; // 属性标题不能为空！
    String P30F6A06 = "P30F6A06"; // 口令标题不能为空！
    String P30F6A07 = "P30F6A07"; // 确认要覆盖现有的口令么？
    String P30F6A08 = "P30F6A08"; // 用户配置数据读取错误，系统无法登录！
    String P30F6A09 = "P30F6A09"; // 用户身份验证错误，请确认您输入的用户名或口令是否正确！
    String P30F6A0A = "P30F6A0A"; // 系统登录失败：请确认你操作系统中Java环境是否配置正确！
    String P30F6A0B = "P30F6A0B"; // 系统登录失败：请确认你操作系统中Java环境是否配置正确！
    String P30F6A0C = "P30F6A0C"; // 系统登录失败：无法正确处理您的登录事件，请与作者联系！
    String P30F6A0D = "P30F6A0D"; // 系统登录失败：无法正确处理您的登录事件，请与作者联系！
    String P30F6A0E = "P30F6A0E"; // 口令更新成功！
    String P30F6A0F = "P30F6A0F"; // 口令更新失败，请检查您输入信息的正确性！
    String P30F6A10 = "P30F6A10"; // 无法读取数据，请重新登录或者请确认您是否拥有读取此数据的权限！
    String P30F6A11 = "P30F6A11"; // 口令名称不能为空！
    String P30F6A12 = "P30F6A12"; // 请输入新的类别名称！
    String P30F6A13 = "P30F6A13"; // 请选择您要更新的类别！
    String P30F6A14 = "P30F6A14"; // 请选择您要删除的类别！
    String P30F6A15 = "P30F6A15"; // 确认要删除此类别么？删除后此类别下的所有数据将会被移动到“默认类别”！
    String P30F6A16 = "P30F6A16"; // 口令名称不能超过{0}个字符！
    String P30F6A17 = "P30F6A17"; // 请选择您要清除历史记录的口令！
    String P30F6A18 = "P30F6A18"; // 清除历史记录数据，会有助于提高软件运行效率，但会<br>影响您的历史数据分析，确认要执行此操作么？
    String P30F6A19 = "P30F6A19"; // 此操作将会删除您选择的口令记录在某一日期之前的历<br>史数据，并且操作将不可恢复，要返回么？
    String P30F6A1A = "P30F6A1A"; // 请输入您日期，您将会删除在此日期之前的历史数据！<br>日期格式：yyyy-mm-dd
    String P30F6A1B = "P30F6A1B"; // 成功删除 {0} 条历史记录数据！
    String P30F6A1C = "P30F6A1C"; // 您正在进行的操作是删除口令数据，确认要继续吗？
    String P30F6A1D = "P30F6A1D"; // 口令数据删除成功！
    String P30F6A1E = "P30F6A1E"; // 请输入新的口令长度数据：
    String P30F6A1F = "P30F6A1F"; // 无法处理您输入的数值，系统将使用默认口令长度。
    String P30F6A20 = "P30F6A20"; // 您输入的数据不正确，请输入一个合适的数值。
    String P30F6A21 = "P30F6A21"; // 请选择您要查看历史记录的口令！
    // ----------------------------------------------------
    // B 自定义语言资源
    // ----------------------------------------------------
    String P30F6B00 = "P30F6B00"; // 3
    String P30F6B01 = "P30F6B01"; //
    String P30F6B02 = "P30F6B02"; // 属性列表
    // ========================================================================
    // A 自定义语言资源
    // ========================================================================
    // ----------------------------------------------------
    // 1 共用语言资源
    // ----------------------------------------------------
    String P30FA100 = "P30FA100"; // 4
    String P30FA101 = "P30FA101"; // ：
    String P30FA102 = "P30FA102"; // yyyy-MM-dd HH:mm:ss
    String P30FA103 = "P30FA103"; // 恢复日期：{0}
    // ----------------------------------------------------
    // 2 标题语言资源
    // ----------------------------------------------------
    String P30FA200 = "P30FA200"; // 2
    String P30FA201 = "P30FA201"; // 口令历史查看
    // ----------------------------------------------------
    // 5 按钮语言资源
    // ----------------------------------------------------
    String P30FA500 = "P30FA500"; // 3
    String P30FA501 = "P30FA501"; // 恢复(&P)
    String P30FA502 = "P30FA502"; // 恢复
    // ----------------------------------------------------
    // A 消息提示语言资源
    // ----------------------------------------------------
    String P30FAA00 = "P30FAA00"; // 4
    String P30FAA01 = "P30FAA01"; // 您当前的操作是恢复历史数据，此操作总是保留历史记录的，确认要继续么？
    String P30FAA02 = "P30FAA02"; // 数据恢复失败！
    String P30FAA03 = "P30FAA03"; // 数据恢复成功！
}
