/*
 * Project:        RMPS
 * Compiler:       JDK1.6.0
 * CopyRight:      &copy; 2007 Amon &reg; Winshine ( Amon@amonsoft.cn / http://amonsoft.cn ).
 * Description:
 *
 */
package cons.prp.aide.P3040000;

/**
 * <ul>
 * <li>功能说明：</li>
 * <br />
 * TODO: 功能说明
 * <li>使用说明：</li>
 * <br />
 * TODO: 使用说明
 * </ul>
 * 
 * @author Amon
 */
public interface LangRes
{
    // ========================================================================
    // 1 共用语言资源
    // ========================================================================
    // ----------------------------------------------------
    // 1 共用语言资源
    // ----------------------------------------------------
    String P3041100 = "P3041100"; // 24
    String P3041101 = "P3041101"; // 迷你日历
    String P3041102 = "P3041102"; // -
    String P3041103 = "P3041103"; // 年
    String P3041104 = "P3041104"; // 月
    String P3041105 = "P3041105"; // 日
    String P3041106 = "P3041106"; // 正
    String P3041107 = "P3041107"; // 二
    String P3041108 = "P3041108"; // 三
    String P3041109 = "P3041109"; // 四
    String P304110A = "P304110A"; // 五
    String P304110B = "P304110B"; // 六
    String P304110C = "P304110C"; // 七
    String P304110D = "P304110D"; // 八
    String P304110E = "P304110E"; // 九
    String P304110F = "P304110F"; // 十
    String P3041110 = "P3041110"; // 冬
    String P3041111 = "P3041111"; // 腊
    String P3041112 = "P3041112"; // 初
    String P3041113 = "P3041113"; // 十
    String P3041114 = "P3041114"; // 廿
    String P3041115 = "P3041115"; // 三
    String P3041116 = "P3041116"; // 一
    String P3041117 = "P3041117"; // 二
    String P3041118 = "P3041118"; // 三
    String P3041119 = "P3041119"; // 四
    String P304111A = "P304111A"; // 五
    String P304111B = "P304111B"; // 六
    String P304111C = "P304111C"; // 七
    String P304111D = "P304111D"; // 八
    String P304111E = "P304111E"; // 九
    String P304111F = "P304111F"; // 十
    String P3041120 = "P3041120"; // （
    String P3041121 = "P3041121"; // ）
    String P3041122 = "P3041122"; // 闰
    String P3041123 = "P3041123"; // 平
    // ----------------------------------------------------
    // 3 标签语言资源
    // ----------------------------------------------------
    String P3041300 = "P3041300"; // f
    String P3041301 = "P3041301"; // 日
    String P3041302 = "P3041302"; // 星期日
    String P3041303 = "P3041303"; // 一
    String P3041304 = "P3041304"; // 星期一
    String P3041305 = "P3041305"; // 二
    String P3041306 = "P3041306"; // 星期二
    String P3041307 = "P3041307"; // 三
    String P3041308 = "P3041308"; // 星期三
    String P3041309 = "P3041309"; // 四
    String P304130A = "P304130A"; // 星期四
    String P304130B = "P304130B"; // 五
    String P304130C = "P304130C"; // 星期五
    String P304130D = "P304130D"; // 六
    String P304130E = "P304130E"; // 星期六
    // ----------------------------------------------------
    // B 自定义语言资源
    // ----------------------------------------------------
    String P3041B00 = "P3041B00"; // 5b
    String P3041B01 = "P3041B01"; // 甲
    String P3041B02 = "P3041B02"; // jiǎ
    String P3041B03 = "P3041B03"; // 甲（jiǎ）
    String P3041B04 = "P3041B04"; // 乙
    String P3041B05 = "P3041B05"; // yǐ
    String P3041B06 = "P3041B06"; // 乙（yǐ）
    String P3041B07 = "P3041B07"; // 丙
    String P3041B08 = "P3041B08"; // bǐng
    String P3041B09 = "P3041B09"; // 丙（bǐng）
    String P3041B0A = "P3041B0A"; // 丁
    String P3041B0B = "P3041B0B"; // dīng
    String P3041B0C = "P3041B0C"; // 丁（dīng）
    String P3041B0D = "P3041B0D"; // 戊
    String P3041B0E = "P3041B0E"; // wù
    String P3041B0F = "P3041B0F"; // 戊（wù）
    String P3041B10 = "P3041B10"; // 己
    String P3041B11 = "P3041B11"; // jǐ
    String P3041B12 = "P3041B12"; // 己（jǐ）
    String P3041B13 = "P3041B13"; // 庚
    String P3041B14 = "P3041B14"; // gēng
    String P3041B15 = "P3041B15"; // 庚（gēng）
    String P3041B16 = "P3041B16"; // 辛
    String P3041B17 = "P3041B17"; // xīn
    String P3041B18 = "P3041B18"; // 辛（xīn）
    String P3041B19 = "P3041B19"; // 壬
    String P3041B1A = "P3041B1A"; // rén
    String P3041B1B = "P3041B1B"; // 壬（rén）
    String P3041B1C = "P3041B1C"; // 癸
    String P3041B1D = "P3041B1D"; // guǐ
    String P3041B1E = "P3041B1E"; // 癸（guǐ）
    String P3041B1F = "P3041B1F"; // 子
    String P3041B20 = "P3041B20"; // zǐ
    String P3041B21 = "P3041B21"; // 子（zǐ）
    String P3041B22 = "P3041B22"; // 丑
    String P3041B23 = "P3041B23"; // chǒu
    String P3041B24 = "P3041B24"; // 丑（chǒu）
    String P3041B25 = "P3041B25"; // 寅
    String P3041B26 = "P3041B26"; // yín
    String P3041B27 = "P3041B27"; // 寅（yín）
    String P3041B28 = "P3041B28"; // 卯
    String P3041B29 = "P3041B29"; // mǎo
    String P3041B2A = "P3041B2A"; // 卯（mǎo）
    String P3041B2B = "P3041B2B"; // 辰
    String P3041B2C = "P3041B2C"; // chén
    String P3041B2D = "P3041B2D"; // 辰（chén）
    String P3041B2E = "P3041B2E"; // 巳
    String P3041B2F = "P3041B2F"; // sì
    String P3041B30 = "P3041B30"; // 巳（sì）
    String P3041B31 = "P3041B31"; // 午
    String P3041B32 = "P3041B32"; // wǔ
    String P3041B33 = "P3041B33"; // 午（wǔ）
    String P3041B34 = "P3041B34"; // 未
    String P3041B35 = "P3041B35"; // wèi
    String P3041B36 = "P3041B36"; // 未（wèi）
    String P3041B37 = "P3041B37"; // 申
    String P3041B38 = "P3041B38"; // shēn
    String P3041B39 = "P3041B39"; // 申（shēn）
    String P3041B3A = "P3041B3A"; // 酉
    String P3041B3B = "P3041B3B"; // yǒu
    String P3041B3C = "P3041B3C"; // 酉（yǒu）
    String P3041B3D = "P3041B3D"; // 戌
    String P3041B3E = "P3041B3E"; // xū
    String P3041B3F = "P3041B3F"; // 戌（xū）
    String P3041B40 = "P3041B40"; // 亥
    String P3041B41 = "P3041B41"; // hài
    String P3041B42 = "P3041B42"; // 亥（hài）
    String P3041B43 = "P3041B43"; // 鼠
    String P3041B44 = "P3041B44"; // 牛
    String P3041B45 = "P3041B45"; // 虎
    String P3041B46 = "P3041B46"; // 兔
    String P3041B47 = "P3041B47"; // 龙
    String P3041B48 = "P3041B48"; // 蛇
    String P3041B49 = "P3041B49"; // 马
    String P3041B4A = "P3041B4A"; // 羊
    String P3041B4B = "P3041B4B"; // 猴
    String P3041B4C = "P3041B4C"; // 鸡
    String P3041B4D = "P3041B4D"; // 狗
    String P3041B4E = "P3041B4E"; // 猪
    String P3041B4F = "P3041B4F"; // 子鼠
    String P3041B50 = "P3041B50"; // 丑牛
    String P3041B51 = "P3041B51"; // 寅虎
    String P3041B52 = "P3041B52"; // 卯兔
    String P3041B53 = "P3041B53"; // 辰龙
    String P3041B54 = "P3041B54"; // 巳蛇
    String P3041B55 = "P3041B55"; // 午马
    String P3041B56 = "P3041B56"; // 未羊
    String P3041B57 = "P3041B57"; // 申猴
    String P3041B58 = "P3041B58"; // 酉鸡
    String P3041B59 = "P3041B59"; // 戌狗
    String P3041B5A = "P3041B5A"; // 亥猪
    // ========================================================================
    // 4 快捷窗口语言资源
    // ========================================================================
    // ----------------------------------------------------
    // 3 标签语言资源
    // ----------------------------------------------------
    String P3044300 = "P3044300"; // 11
    String P3044301 = "P3044301"; // 日
    String P3044302 = "P3044302"; // 星期日
    String P3044303 = "P3044303"; // 一
    String P3044304 = "P3044304"; // 星期一
    String P3044305 = "P3044305"; // 二
    String P3044306 = "P3044306"; // 星期二
    String P3044307 = "P3044307"; // 三
    String P3044308 = "P3044308"; // 星期三
    String P3044309 = "P3044309"; // 四
    String P304430A = "P304430A"; // 星期四
    String P304430B = "P304430B"; // 五
    String P304430C = "P304430C"; // 星期五
    String P304430D = "P304430D"; // 六
    String P304430E = "P304430E"; // 星期六
    String P304430F = "P304430F"; // 今
    String P3044310 = "P3044310"; // 转到今日
    // ----------------------------------------------------
    // 6 菜单语言资源
    // ----------------------------------------------------
    String P3044600 = "P3044600"; // f
    String P3044601 = "P3044601"; // 日视图
    String P3044602 = "P3044602"; // 日视图
    String P3044603 = "P3044603"; // 月视图
    String P3044604 = "P3044604"; // 月视图
    String P3044605 = "P3044605"; // 今日
    String P3044606 = "P3044606"; // 今日
    String P3044607 = "P3044607"; // 上一年
    String P3044608 = "P3044608"; // 上一年
    String P3044609 = "P3044609"; // 上一月
    String P304460A = "P304460A"; // 上一月
    String P304460B = "P304460B"; // 下一月
    String P304460C = "P304460C"; // 下一月
    String P304460D = "P304460D"; // 下一年
    String P304460E = "P304460E"; // 下一年
    // ========================================================================
    // 5 迷你窗口语言资源
    // ========================================================================
    // ----------------------------------------------------
    // 3 标签语言资源
    // ----------------------------------------------------
    String P3045300 = "P3045300"; // 7
    String P3045301 = "P3045301"; // 今日
    String P3045302 = "P3045302"; // 转到今日
    String P3045303 = "P3045303"; // 管理
    String P3045304 = "P3045304"; // 节日数据管理
    String P3045305 = "P3045305"; // 设置
    String P3045306 = "P3045306"; // 用户偏好设置
    // ----------------------------------------------------
    // 5 按钮语言资源
    // ----------------------------------------------------
    String P3045500 = "P3045500"; // 9
    String P3045501 = "P3045501"; // <<
    String P3045502 = "P3045502"; // 上一年
    String P3045503 = "P3045503"; // <
    String P3045504 = "P3045504"; // 上一月
    String P3045505 = "P3045505"; // >
    String P3045506 = "P3045506"; // 下一月
    String P3045507 = "P3045507"; // >>
    String P3045508 = "P3045508"; // 下一年
    // ========================================================================
    // 9 向导窗口语言资源
    // ========================================================================
    // ----------------------------------------------------
    // 2 标题语言资源
    // ----------------------------------------------------
    String P3049200 = "P3049200"; // 1
    // ----------------------------------------------------
    // 3 标签语言资源
    // ----------------------------------------------------
    String P3049300 = "P3049300"; // 2c
    String P3049301 = "P3049301"; // 显示标题(&T)
    String P3049302 = "P3049302"; //
    String P3049303 = "P3049303"; // 节日说明(&P)
    String P3049304 = "P3049304"; //
    String P3049305 = "P3049305"; // 节日起始年份：
    String P3049306 = "P3049306"; // 年
    String P3049307 = "P3049307"; // 月
    String P3049308 = "P3049308"; // 日
    String P3049309 = "P3049309"; // 周（年）
    String P304930A = "P304930A"; // 周（月）
    String P304930B = "P304930B"; // 提示年份周期：
    String P304930C = "P304930C"; // 年份(&Y)
    String P304930D = "P304930D"; //
    String P304930E = "P304930E"; //
    String P304930F = "P304930F"; // 年
    String P3049310 = "P3049310"; //
    String P3049311 = "P3049311"; // 提示月份周期：
    String P3049312 = "P3049312"; // 月份(&M)
    String P3049313 = "P3049313"; //
    String P3049314 = "P3049314"; //
    String P3049315 = "P3049315"; // 月
    String P3049316 = "P3049316"; //
    String P3049317 = "P3049317"; // 提示日期周期：
    String P3049318 = "P3049318"; // 日期(&D)
    String P3049319 = "P3049319"; //
    String P304931A = "P304931A"; //
    String P304931B = "P304931B"; // 日
    String P304931C = "P304931C"; //
    String P304931D = "P304931D"; // 提示结束年份：
    String P304931F = "P304931F"; // 年
    String P3049320 = "P3049320"; // 月
    String P3049321 = "P3049321"; // 日
    String P3049322 = "P3049322"; // 周（年）
    String P3049323 = "P3049323"; // 周（月）
    String P3049324 = "P3049324"; // 相关链接(&L)
    String P3049325 = "P3049325"; // 相关说明(&M)
    String P3049326 = "P3049326"; // 数据添加成功！
    String P3049327 = "P3049327"; // 提示周（年）周期
    String P3049328 = "P3049328"; // 周(&W)
    String P3049329 = "P3049329"; // 周
    String P304932A = "P304932A"; // 提示周（月）周期
    String P304932B = "P304932B"; // 周(&Z)
    // ----------------------------------------------------
    // 4 文本语言资源
    // ----------------------------------------------------
    String P3049400 = "P3049400"; // 2d
    String P3049401 = "P3049401"; // 通过本向导您可以快速的添加节日数据。请输入节日标题，长度不超过256个汉字。
    String P3049402 = "P3049402"; // 通常一个节日都是有其起始时间的，您可以输入此节日的详细起始时间，可以跳过此步。
    String P3049403 = "P3049403"; // 在此处输入节日出现的年份信息，您可以输入具体的年份数值，也可以输入含有变量y的表达。
    String P3049404 = "P3049404"; // 在此处输入节日出现的月份信息，您输入具体的月份数值，也可以输入含有变量m的表达式。
    String P3049405 = "P3049405"; // 在此处输入节日出现的日期信息，您输入具体的月份数值，也可以输入含有变量d的表达式。
    String P3049406 = "P3049406"; // 当您输入节日的结束时间后，此节日信息仅在起始到结束的时间断内显示，您也可以跳过此步。
    String P3049407 = "P3049407"; // 在此处，您可以输入此节日的详细链接地址，及一些个人的附注信息。
    String P3049408 = "P3049408"; // 恭喜，您已经成功添加了一个节日数据，要继续添加新的节日数据，请点击“继续”。
    String P3049409 = "P3049409"; //
    String P304940A = "P304940A"; // 显示标题
    String P304940B = "P304940B"; //
    String P304940C = "P304940C"; // 节日说明
    String P304940D = "P304940D"; //
    String P304940E = "P304940E"; // 节日起始年份
    String P304940F = "P304940F"; //
    String P3049410 = "P3049410"; // 节日起始月份
    String P3049411 = "P3049411"; //
    String P3049412 = "P3049412"; // 节日起始日期
    String P3049413 = "P3049413"; //
    String P3049414 = "P3049414"; // 节日起始周（每年第几周）
    String P3049415 = "P3049415"; //
    String P3049416 = "P3049416"; // 节日起始周（每月第几周）
    String P3049417 = "P3049417"; // y
    String P3049418 = "P3049418"; // 2
    String P3049419 = "P3049419"; //
    String P304941A = "P304941A"; // 2
    String P304941B = "P304941B"; //
    String P304941C = "P304941C"; // 2
    String P304941D = "P304941D"; //
    String P304941E = "P304941E"; // 提示结束年份
    String P304941F = "P304941F"; //
    String P3049420 = "P3049420"; // 提示结束月份
    String P3049421 = "P3049421"; //
    String P3049422 = "P3049422"; // 提示结束日期
    String P3049423 = "P3049423"; //
    String P3049424 = "P3049424"; // 节日结束周（每年第几周）
    String P3049425 = "P3049425"; //
    String P3049426 = "P3049426"; // 节日结束周（每月第几周）
    String P3049427 = "P3049427"; //
    String P3049428 = "P3049428"; // 节日详细信息链接地址
    String P3049429 = "P3049429"; //
    String P304942A = "P304942A"; // 其它说明信息
    String P304942B = "P304942B"; // 在此处输入节日出现的周信息，您输入具体的每年第几周数值，也可以输入含有变量w的表达式。
    String P304942C = "P304942C"; // 在此处输入节日出现的周信息，您输入具体的每月第几周数值，也可以输入含有变量z的表达式。
    // ----------------------------------------------------
    // 5 按钮语言资源
    // ----------------------------------------------------
    String P3049500 = "P3049500"; // b
    String P3049501 = "P3049501"; // 上一步(&P)
    String P3049502 = "P3049502"; // 上一步
    String P3049503 = "P3049503"; // 下一步(&N)
    String P3049504 = "P3049504"; // 下一步
    String P3049505 = "P3049505"; // 取消(&C)
    String P3049506 = "P3049506"; // 取消
    String P3049507 = "P3049507"; // 继续(&C)
    String P3049508 = "P3049508"; // 继续添加下一个数据
    String P3049509 = "P3049509"; // 完成(&O)
    String P304950A = "P304950A"; // 结束添加数据
    // ----------------------------------------------------
    // 7 单选框语言资源
    // ----------------------------------------------------
    String P3049700 = "P3049700"; // 1f
    String P3049701 = "P3049701"; // 每年
    String P3049702 = "P3049702"; // 每年
    String P3049703 = "P3049703"; // 从今年起每
    String P3049704 = "P3049704"; // 从今年起每
    String P3049705 = "P3049705"; // 其它年份
    String P3049706 = "P3049706"; // 其它年份
    String P3049707 = "P3049707"; // 每月
    String P3049708 = "P3049708"; // 每月
    String P3049709 = "P3049709"; // 从本月起每
    String P304970A = "P304970A"; // 从本月起每
    String P304970B = "P304970B"; // 其它月份
    String P304970C = "P304970C"; // 其它月份
    String P304970D = "P304970D"; // 每日
    String P304970E = "P304970E"; // 每日
    String P304970F = "P304970F"; // 从今日起每
    String P3049710 = "P3049710"; // 从今日起每
    String P3049711 = "P3049711"; // 其它日期
    String P3049712 = "P3049712"; // 其它日期
    String P3049713 = "P3049713"; // 每周（年）
    String P3049714 = "P3049714"; // 每周（年）
    String P3049715 = "P3049715"; // 从本周起每
    String P3049716 = "P3049716"; // 从本周起每
    String P3049717 = "P3049717"; // 其它周（年）
    String P3049718 = "P3049718"; // 其它周（年）
    String P3049719 = "P3049719"; // 每周（月）
    String P304971A = "P304971A"; // 每周（月）
    String P304971B = "P304971B"; // 从本周起每隔
    String P304971C = "P304971C"; // 从本周起每隔
    String P304971D = "P304971D"; // 其它周（月）
    String P304971E = "P304971E"; // 其它周（月）
    // ----------------------------------------------------
    // A 消息提示语言资源
    // ----------------------------------------------------
    String P3049A00 = "P3049A00"; // e
    String P3049A01 = "P3049A01"; // 提示标题不能为空！
    String P3049A02 = "P3049A02"; // 提示标题文本长度不能超过{0}个字符！
    String P3049A03 = "P3049A03"; // 提示内容文本长度不能超过{0}个字符！
    String P3049A04 = "P3049A04"; // 年份表达式文本长度不能超过{0}个字符！
    String P3049A05 = "P3049A05"; // 年份表达式中存在非法字符，请重新输入！
    String P3049A06 = "P3049A06"; // 月份表达式文本长度不能超过{0}个字符！
    String P3049A07 = "P3049A07"; // 月份表达式中存在非法字符，请重新输入！
    String P3049A08 = "P3049A08"; // 日期表达式文本长度不能超过{0}个字符！
    String P3049A09 = "P3049A09"; // 日期表达式中存在非法字符，请重新输入！
    String P3049A0A = "P3049A0A"; // 周（年）表达式文本长度不能超过{0}个字符！
    String P3049A0B = "P3049A0B"; // 周（年）表达式中存在非法字符，请重新输入！
    String P3049A0C = "P3049A0C"; // 周（月）表达式文本长度不能超过{0}个字符！
    String P3049A0D = "P3049A0D"; // 周（月）表达式中存在非法字符，请重新输入！
}
