/*
 * Project:        RMPS
 * Compiler:       JDK1.6.0
 * CopyRight:      &copy; 2007 Amon &reg; Winshine ( Amon@amonsoft.cn / http://amonsoft.cn ).
 * Description:
 *
 */
package cons.ui;

/**
 * <ul>
 * <li>功能说明：</li>
 * <br />
 * 系统公共语言资源
 * <li>使用说明：</li>
 * <br />
 * TODO: 使用说明
 * </ul>
 * @author Amon
 */
public interface LangRes
{
    // ////////////////////////////////////////////////////////////////////////
    // 系统初始化语言资源
    // ////////////////////////////////////////////////////////////////////////
    /** 联系作者 */
    String MESG_INIT_0000 = "对此引起的不便作者深表歉意，如果您有什么问题请与作者联系！";
    /** JRE运行环境版本检测 */
    String MESG_INIT_0001 = "您的JRE版本低于本软件的最低运行需求，软件将无法正常运行。<br>请下载最新版本的JRE：http://www.java.com/";
    /** 数据库连接失败 */
    String MESG_INIT_0002 = "数据库连接初始化失败，可能的原因有：<br>·启动多个应用实例；<br>·数据库文档格式不正确；<br>{0}";
    /** 数据库配置数据读取失败 */
    String MESG_INIT_0003 = "数据库版本信息读取失败，{0}";
    /** 数据库版本较低 */
    String MESG_INIT_0004 = "您正在使用的数据库版本为 {0}，低于系统最低需求版本 {1}，系统无法正常启动！";
    /** 用户配置信息读取错误 */
    String MESG_INIT_0005 = "用户配置信息读取错误，{0}";
    /** 界面样式应用错误 */
    String MESG_INIT_0006 = "应用当前操作系统界面出现错误，系统将使用Java默认界面样式，{0}";
    /** 系统启动失败 */
    String MESG_INIT_0007 = "系统启动失败，{0}";
    /** 系统退出语言资源 */
    String MESG_EXIT_0000 = "系统退出语言资源";
    /** 数据库关闭异常 */
    String MESG_EXIT_0001 = "数据库关闭异常：{0}";
    /** 系统退出错误 */
    String MESG_EXIT_0002 = "系统退出错误：数据库连接无法关闭，严重的情况下可能会造成您的数据丢失，{0}";
    // ////////////////////////////////////////////////////////////////////////
    // 公共界面语言资源
    // ////////////////////////////////////////////////////////////////////////
    // ----------------------------------------------------
    // 窗口按钮
    // ----------------------------------------------------
    /** 消息标题 */
    String TITLE_MESSAGE = "温馨提示";
    /** 窗口关闭 */
    String BUTN_TEXT_EXITBUTN = "X";
    String BUTN_TIPS_EXITBUTN = "关闭窗口";
    /** 窗口隐藏 */
    String BUTN_TEXT_HIDEBUTN = "_";
    String BUTN_TIPS_HIDEBUTN = "隐藏窗口";
    /** 托盘图标 */
    String TRAY_MESG_ICONTRAY = "主窗口已隐藏，您可以通过双击此图标打开主窗口！";
    // ----------------------------------------------------
    // 快捷菜单
    // ----------------------------------------------------
    // ----------------------------------------------------
    // 文件操作
    // ----------------------------------------------------
    String MESG_FILE_0000 = "";
    /** 文件不存在 */
    String MESG_FILE_0001 = "文件 {0} 不存在！";
    /** 不是有效的文件 */
    String MESG_FILE_0002 = "{0} 不是一个有效的文件！";
    /** 文件不可读取 */
    String MESG_FILE_0003 = "无法读取文件 {0} ！";
    /** 文件已存在 */
    String MESG_FILE_0004 = "文件 {0} 已存在！";
    /** 文件不可写 */
    String MESG_FILE_0005 = "无法写入文件 {0} !";
    /** 文件删除错误 */
    String MESG_FILE_0006 = "无法删除文件 {0} !";
    // ----------------------------------------------------
    // 系统其它
    // ----------------------------------------------------
    /** 系统其它 */
    String MESG_OTHR_0000 = "MSGO0000";
    /** 系统界面语言更新，提示重新启动 */
    String MESG_OTHR_0001 = "界面语言已更新，您的配置需要在下一次启动应用程序时生效，请重新启动应用程序！";
    /** 配置浏览器路径 */
    String MESG_OTHR_0002 = "当前操作系统平台下尚未配置浏览器路径信息，现在要进行配置么？";
    /** 文件不存在 */
    String MESG_OTHR_0003 = "<font color=\"#ff0000\">指定浏览器路径 “{0}” 已经不存在！</font><br>是否要重新指定浏览器路径！";
    /** 浏览器运行错误 */
    String MESG_OTHR_0004 = "浏览器运行错误，{0}";
    /** 浏览器路径不存在 */
    String MESG_OTHR_0005 = "<font color=\"#ff0000\">指定浏览器路径不存在！</font><br>是否要重新指定浏览器路径！";
    /** 浏览器不是文件 */
    String MESG_OTHR_0006 = "<font color=\"#FF0000\">指定浏览器路径不是一个文件，系统可能无法执行！</font><br>请重新选择浏览器路径！";
    /** 浏览器路径信息保存错误 */
    String MESG_OTHR_0007 = "浏览器路径信息保存错误，{0}";
    /** 文件打开对话框打开文件错误 */
    String MESG_OTHR_0008 = "文件打开错误，{0}";
    /** 文件后缀信息不存在 */
    String MESG_OTHR_0009 = "指定文件 “<font color=\"#FF0000\">{0}</font>” 后缀不存在！";
    // ----------------------------------------------------
    // 数据备份
    // ----------------------------------------------------
    /** 数据备份 */
    String MESG_BACK_0000 = "MSGB0000";
    /** 数据库备份成功 */
    String MESG_BACK_0001 = "数据备份成功！";
    // 数据备份成功！";
    /** 数据备份失败： */
    String MESG_BACK_0002 = "数据备份失败：{0}";
    /** 未知错误 */
    String MESG_BACK_0003 = "数据备份失败：系统出现未知错误，{0}";
    // 数据备份失败：系统出现未知错误，{0}";
    /** 数据库关闭失败 */
    String MESG_BACK_0004 = "数据备份失败：无法关闭数据库连接，请重新启动本应用程序或稍后再试！";
    // 数据备份失败：无法关闭数据库连接，请重新启动本应用程序或稍后再试！";
    // ----------------------------------------------------
    // 运行命令
    // ----------------------------------------------------
    String MESG_CMDS_0000 = "";
    String MESG_CMDS_0001 = "无法运行命令 {0}，请确认您输入的正确性！";
    // ----------------------------------------------------
    // 信息摘要
    // ----------------------------------------------------
    String MESG_HASH_0000 = "";
    String MESG_HASH_0001 = "您输入的字符串的 {0} Hash值为：\n{1}";
    // ----------------------------------------------------
    // 网络浏览
    // ----------------------------------------------------
    /** 网络浏览错误 */
    String MESG_INET_0000 = "";
    /** 网络浏览错误 */
    String MESG_INET_0001 = "执行您要浏览的路径 {0} 错误：{1}";
    // ----------------------------------------------------
    // 数据恢复
    // ----------------------------------------------------
    /** 数据恢复 */
    String MESG_PICK_0000 = "MSGP0000";
    /** 数据恢复成功 */
    String MESG_PICK_0001 = "数据恢复成功！";
    // 数据恢复成功！";
    /** 未知错误 */
    String MESG_PICK_0002 = "数据恢复失败：{0}";
    /** 无法关闭数据库 */
    String MESG_PICK_0003 = "数据恢复错误：系统出现未知错误，{0}";
    /** 数据库备份文件不存在 */
    String MESG_PICK_0004 = "数据恢复失败：无法关闭数据库连接，请重新启动本应用程序或稍后再试！";
    String MESG_LANG_0001 = "语言资源读取错误，系统将使用默认语言！";
}
