/*
 * Project:        RMPS
 * Compiler:       JDK1.6.0
 * CopyRight:      &copy; 2007 Amon &reg; Winshine ( Amon@amonsoft.cn / http://amonsoft.cn ).
 * Description:
 *
 */
package cons.comn.user.U0010000;

/**
 * <ul>
 * <li>功能说明：</li>
 * <br />
 * TODO: 功能说明
 * <li>使用说明：</li>
 * <br />
 * TODO: 使用说明
 * </ul>
 * @author Amon
 */
public interface LangRes
{
    // ========================================================================
    // 5 迷你窗口语言资源
    // ========================================================================
    // ----------------------------------------------------
    // 3 标签语言资源
    // ----------------------------------------------------
    String U0015300 = "U0015300"; // 7
    String U0015301 = "U0015301"; // 名称(&N)
    String U0015302 = "U0015302"; // 登录名称
    String U0015303 = "U0015303"; // 口令(&P)
    String U0015304 = "U0015304"; // 登录口令
    String U0015305 = "U0015305"; // 确认(&F)
    String U0015306 = "U0015306"; // 口令确认
    // ----------------------------------------------------
    // 5 按钮语言资源
    // ----------------------------------------------------
    String U0015500 = "U0015500"; // 5
    String U0015501 = "U0015501"; // 取消(&C)
    String U0015502 = "U0015502"; // 取消
    String U0015503 = "U0015503"; // 确认(&O)
    String U0015504 = "U0015504"; // 确认
    // ----------------------------------------------------
    // A 消息提示语言资源
    // ----------------------------------------------------
    String U0015A00 = "U0015A00"; // 4
    String U0015A01 = "U0015A01"; // 登录名称不能为空！
    String U0015A02 = "U0015A02"; // 登录口令不能为空！
    String U0015A03 = "U0015A03"; // 您两次输入的口令不一致，请重新输入！
}
