/*
 * Project:        RMPS
 * Compiler:       JDK1.6.0
 * CopyRight:      &copy; 2007 Amon &reg; Winshine ( Amon@amonsoft.cn / http://amonsoft.cn ).
 * Description:
 *
 */
package cons.comn.user.U0020000;

/**
 * <ul>
 * <li>功能说明：</li>
 * <br />
 * TODO: 功能说明
 * <li>使用说明：</li>
 * <br />
 * TODO: 使用说明
 * </ul>
 * @author Amon
 */
public interface LangRes
{
    // ========================================================================
    // 5 迷你窗口语言资源
    // ========================================================================
    // ----------------------------------------------------
    // 3 标签语言资源
    // ----------------------------------------------------
    String U0025300 = "U0025300"; // b
    String U0025301 = "U0025301"; // 原有口令(&X)
    String U0025302 = "U0025302"; // 原有口令
    String U0025303 = "U0025303"; // 新口令(&P)
    String U0025304 = "U0025304"; // 新口令
    String U0025305 = "U0025305"; // 口令确认(&R)
    String U0025306 = "U0025306"; // 口令确认
    // ----------------------------------------------------
    // 5 按钮语言资源
    // ----------------------------------------------------
    String U0025500 = "U0025500"; // 5
    String U0025501 = "U0025501"; // 修改(&M)
    String U0025502 = "U0025502"; // 修改
    String U0025503 = "U0025503"; // 取消(&C)
    String U0025504 = "U0025504"; // 取消
    // ----------------------------------------------------
    // A 消息提示语言资源
    // ----------------------------------------------------
    String U0025A00 = "U0025A00"; // 4
    String U0025A01 = "U0025A01"; // 原有口令不能为空！
    String U0025A02 = "U0025A02"; // 新口令不能为空！
    String U0025A03 = "U0025A03"; // 您两次输入的口令不一致，请重新输入！
}
