/*
 * Project:        RMPS
 * Compiler:       JDK1.6.0
 * CopyRight:      &copy; 2007 Amon &reg; Winshine ( Amon@amonsoft.cn / http://amonsoft.cn ).
 * Description:
 *
 */
package cons.db;

import cons.SysCons;

/**
 * <ul>
 * <li>功能说明：</li>
 * <br />
 * Comn系统数据库设计常量
 * <li>使用说明：</li>
 * <br />
 * </ul>
 * @author Amon
 */
public interface ComnCons
{
    // ========================================================================
    // 自然资源
    // ========================================================================
    // ----------------------------------------------------
    // 自然语言
    // ----------------------------------------------------
    /** 自然语言 */
    String C1010000 = "C1010000";
    /** 自然语言：语言索引 */
    String C1010001 = "C1010001";
    int C1010001_SIZE = 16;
    /** 自然语言：本语名称 */
    String C1010002 = "C1010002";
    int C1010002_SIZE = 256;
    /** 自然语言：英语名称 */
    String C1010003 = "C1010003";
    int C1010003_SIZE = 256;
    /** 自然语言：国别索引 */
    String C1010004 = "C1010004";
    int C1010004_SIZE = 16;
    /** 自然语言：ISO639-1 */
    String C1010005 = "C1010005";
    int C1010005_SIZE = 2;
    /** 自然语言：ISO639-2 */
    String C1010006 = "C1010006";
    int C1010006_SIZE = 3;
    /** 自然语言：ISO639-3 */
    String C1010007 = "C1010007";
    int C1010007_SIZE = 3;
    /** 自然语言：ISO639-4 */
    String C1010008 = "C1010008";
    int C1010008_SIZE = 6;
    /** 自然语言：ISO639-5 */
    String C1010009 = "C1010009";
    int C1010009_SIZE = 6;
    /** 自然语言：ISO639-6 */
    String C101000A = "C101000A";
    int C101000A_SIZE = 6;
    /** 自然语言：是否母语 */
    String C101000B = "C101000B";
    int C101000B_SIZE = 1;
    /** 自然语言：语言状态 */
    String C101000C = "C101000C";
    int C101000C_SIZE = 1;
    /** 自然语言：语言简介 */
    String C101000D = "C101000D";
    int C101000D_SIZE = SysCons.DBCD_DESP_SIZE;
    /** 自然语言：相关说明 */
    String C101000E = "C101000E";
    int C101000E_SIZE = SysCons.DBCD_DESP_SIZE;
    /** 自然语言：更新日期 */
    String C101000F = "C101000F";
    /** 自然语言：创建日期 */
    String C1010010 = "C1010010";
    // ----------------------------------------------------
    // 区域语言
    // ----------------------------------------------------
    /** 区域语言 */
    String C1010100 = "C1010100";
    /** 区域语言：显示排序 */
    String C1010101 = "C1010101";
    /** 区域语言：语言索引 */
    String C1010102 = "C1010102";
    int C1010102_SIZE = 16;
    /** 区域语言：语言代码 */
    String C1010103 = "C1010103";
    int C1010103_SIZE = 2;
    /** 区域语言：国家代码 */
    String C1010104 = "C1010104";
    int C1010104_SIZE = 2;
    /** 区域语言：本语名称 */
    String C1010105 = "C1010105";
    int C1010105_SIZE = 256;
    /** 区域语言：英语名称 */
    String C1010106 = "C1010106";
    int C1010106_SIZE = 256;
    /** 区域语言：语言简介 */
    String C1010107 = "C1010107";
    int C1010107_SIZE = SysCons.DBCD_DESP_SIZE;
    /** 区域语言：相关说明 */
    String C1010108 = "C1010108";
    int C1010108_SIZE = SysCons.DBCD_DESP_SIZE;
    /** 区域语言：更新日期 */
    String C1010109 = "C1010109";
    /** 区域语言：创建日期 */
    String C101010A = "C101010A";
    // ----------------------------------------------------
    // 国家资源
    // ----------------------------------------------------
    /** 国家资源 */
    String C1110100 = "C1110100";
    /** 国家资源：国家索引 */
    String C1110101 = "C1110101";
    int C1110101_SIZE = 16;
    /** 国家资源：语言索引 */
    String C1110102 = "C1110102";
    int C1110102_SIZE = 16;
    /** 国家资源：国家简称 */
    String C1110103 = "C1110103";
    int C1110103_SIZE = 256;
    /** 国家资源：国家全称 */
    String C1110104 = "C1110104";
    int C1110104_SIZE = 512;
    /** 国家资源：ISO3166-1 */
    String C1110105 = "C1110105";
    int C1110105_SIZE = 2;
    /** 国家资源：ISO3166-2 */
    String C1110106 = "C1110106";
    int C1110106_SIZE = 3;
    /** 国家资源：ISO3166-3 */
    String C1110107 = "C1110107";
    int C1110107_SIZE = 6;
    /** 国家资源：国家代码 */
    String C1110108 = "C1110108";
    int C1110108_SIZE = 3;
    /** 国家资源：国家简介 */
    String C1110109 = "C1110109";
    int C1110109_SIZE = SysCons.DBCD_DESP_SIZE;
    /** 国家资源：相关说明 */
    String C111010A = "C111010A";
    int C111010A_SIZE = SysCons.DBCD_DESP_SIZE;
    /** 国家资源：更新日期 */
    String C111010B = "C111010B";
    /** 国家资源：创建日期 */
    String C111010C = "C111010C";
    // ========================================================================
    // 信息资源
    // ========================================================================
    // ----------------------------------------------------
    // 一级类别
    // ----------------------------------------------------
    /** 一级类别 */
    String C2010000 = "C2010000";
    /** 一级类别：显示排序 */
    String C2010001 = "C2010001";
    /** 一级类别：类别索引 */
    String C2010002 = "C2010002";
    int C2010002_SIZE = 16;
    /** 一级类别：系统索引 */
    String C2010003 = "C2010003";
    int C2010003_SIZE = 8;
    /** 一级类别：类别名称 */
    String C2010004 = "C2010004";
    int C2010004_SIZE = 256;
    /** 一级类别：类别提示 */
    String C2010005 = "C2010005";
    int C2010005_SIZE = 256;
    /** 一级类别：类别键值 */
    String C2010006 = "C2010006";
    int C2010006_SIZE = 64;
    /** 一级类别：类别描述 */
    String C2010007 = "C2010007";
    int C2010007_SIZE = SysCons.DBCD_DESP_SIZE;
    /** 一级类别：更新时间 */
    String C2010008 = "C2010008";
    /** 一级类别：创建时间 */
    String C2010009 = "C2010009";
    // ----------------------------------------------------
    // 二级类别
    // ----------------------------------------------------
    /** 二级类别 */
    String C2010100 = "C2010100";
    /** 显示排序 */
    String C2010101 = "C2010101";
    /** 类别级别 */
    String C2010102 = "C2010102";
    /** 类别索引 */
    String C2010103 = "C2010103";
    int C2010103_SIZE = 16;
    /** 一级索引 */
    String C2010104 = "C2010104";
    int C2010104_SIZE = 16;
    /** 类别名称 */
    String C2010105 = "C2010105";
    int C2010105_SIZE = 256;
    /** 类别提示 */
    String C2010106 = "C2010106";
    int C2010106_SIZE = 256;
    /** 类别键值 */
    String C2010107 = "C2010107";
    int C2010107_SIZE = 64;
    /** 类别描述 */
    String C2010108 = "C2010108";
    int C2010108_SIZE = 2048;
    /** 更新时间 */
    String C2010109 = "C2010109";
    /** 创建时间 */
    String C201010A = "C201010A";
    // ========================================================================
    // 用户资源
    // ========================================================================
    // ----------------------------------------------------
    // 系统用户
    // ----------------------------------------------------
    /** 系统用户 */
    String C3010000 = "C3010000";
    /** 系统用户：显示排序 */
    String C3010001 = "C3010001";
    /** 系统用户：人员索引 */
    String C3010002 = "C3010002";
    int C3010002_SIZE = 16;
    /** 系统用户：注册系统 */
    String C3010003 = "C3010003";
    int C3010003_SIZE = 8;
    /** 系统用户：注册名称 */
    String C3010004 = "C3010004";
    int C3010004_SIZE = 64;
    /** 系统用户：联系邮件 */
    String C3010005 = "C3010005";
    int C3010005_SIZE = 256;
    /** 系统用户：登录口令 */
    String C3010006 = "C3010006";
    int C3010006_SIZE = 512;
    /** 系统用户：个性昵称 */
    String C3010007 = "C3010007";
    int C3010007_SIZE = 32;
    /** 系统用户：个性图标 */
    String C3010008 = "C3010008";
    int C3010008_SIZE = 16;
    /** 系统用户：个性签名 */
    String C3010009 = "C3010009";
    int C3010009_SIZE = 256;
    /** 系统用户：个人主页 */
    String C301000A = "C301000A";
    int C301000A_SIZE = 1024;
    /** 系统用户：个人简介 */
    String C301000B = "C301000B";
    int C301000B_SIZE = 1024;
    /** 系统用户：相关说明 */
    String C301000C = "C301000C";
    int C301000C_SIZE = 2048;
    /** 系统用户：更新日期 */
    String C301000D = "C301000D";
    /** 系统用户：创建日期 */
    String C301000E = "C301000E";
}
