/*
 * Project:        RMPS
 * Compiler:       JDK1.6.0
 * CopyRight:      &copy; 2007 Amon &reg; Winshine ( Amon@amonsoft.cn / http://amonsoft.cn ).
 * Description:
 *
 */
package cons.db;

import cons.SysCons;

/**
 * <ul>
 * <li>功能说明：</li>
 * <br />
 * PRP系统数据库设计常量
 * <li>使用说明：</li>
 * <br />
 * </ul>
 * @author Amon
 */
public interface PrpCons
{
    // ========================================================================
    // 辅助模块
    // ========================================================================
    // ----------------------------------------------------
    // 后缀解析
    // ----------------------------------------------------
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    // 后缀数据
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    /** 后缀数据 */
    String P3010000 = "P3010000";
    /** 后缀数据：显示排序 */
    String P3010001 = "P3010001";
    /** 后缀数据：处理字长 */
    String P3010002 = "P3010002";
    /** 后缀数据：后缀索引 */
    String P3010003 = "P3010003";
    int P3010003_SIZE = 32;
    /** 后缀数据：公司索引 */
    String P3010004 = "P3010004";
    int P3010004_SIZE = 16;
    /** 后缀数据：软件索引 */
    String P3010005 = "P3010005";
    int P3010005_SIZE = 16;
    /** 后缀数据：文件索引 */
    String P3010006 = "P3010006";
    int P3010006_SIZE = 16;
    /** 后缀数据：文档格式 */
    String P3010007 = "P3010007";
    int P3010007_SIZE = 16;
    /** 后缀数据：描述索引 */
    String P3010008 = "P3010008";
    int P3010008_SIZE = 16;
    /** 后缀数据：MIME索引 */
    String P3010009 = "P3010009";
    int P3010009_SIZE = 16;
    /** 后缀数据：备选索引 */
    String P301000A = "P301000A";
    int P301000A_SIZE = 16;
    /** 后缀数据：类别索引 */
    String P301000B = "P301000B";
    int P301000B_SIZE = 16;
    /** 后缀数据：家族平台 */
    String P301000C = "P301000C";
    /** 后缀数据：应用平台 */
    String P301000D = "P301000D";
    int P301000D_SIZE = 16;
    /** 后缀数据：人员索引 */
    String P301000E = "P301000E";
    int P301000E_SIZE = 16;
    /** 后缀数据：附注信息 */
    String P301000F = "P301000F";
    int P301000F_SIZE = SysCons.DBCD_DESP_SIZE;
    /** 后缀数据：更新日期 */
    String P3010010 = "P3010010";
    /** 后缀数据：创建日期 */
    String P3010011 = "P3010011";
    /** 后缀数据：文件后缀 */
    String P3010012 = "P3010012";
    int P3010012_SIZE = 256;
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    // 公司信息
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    /** 公司信息 */
    String P3010100 = "P3010100";
    /** 公司信息：显示排序 */
    String P3010101 = "P3010101";
    /** 公司信息：公司索引 */
    String P3010102 = "P3010102";
    int P3010102_SIZE = 16;
    /** 公司信息：国别信息 */
    String P3010103 = "P3010103";
    int P3010103_SIZE = 8;
    /** 公司信息：公司徽标 */
    String P3010104 = "P3010104";
    int P3010104_SIZE = 16;
    /** 公司信息：本语名称 */
    String P3010105 = "P3010105";
    int P3010105_SIZE = 256;
    /** 公司信息：英语名称 */
    String P3010106 = "P3010106";
    int P3010106_SIZE = 256;
    /** 公司信息：公司网址 */
    String P3010107 = "P3010107";
    int P3010107_SIZE = SysCons.DBCD_LINK_SIZE;
    /** 公司信息：公司描述 */
    String P3010108 = "P3010108";
    int P3010108_SIZE = SysCons.DBCD_DESP_SIZE;
    /** 公司信息：附注信息 */
    String P3010109 = "P3010109";
    int P3010109_SIZE = SysCons.DBCD_DESP_SIZE;
    /** 公司信息：更新日期 */
    String P301010A = "P301010A";
    /** 公司信息：创建日期 */
    String P301010B = "P301010B";
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    // 软件信息
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    /** 软件信息 */
    String P3010200 = "P3010200";
    /** 软件信息：显示排序 */
    String P3010201 = "P3010201";
    /** 软件信息：软件索引 */
    String P3010202 = "P3010202";
    int P3010202_SIZE = 16;
    /** 软件信息：公司名称 */
    String P3010203 = "P3010203";
    int P3010203_SIZE = 16;
    /** 软件信息：软件图标 */
    String P3010204 = "P3010204";
    int P3010204_SIZE = 16;
    /** 软件信息：软件名称 */
    String P3010205 = "P3010205";
    int P3010205_SIZE = 128;
    /** 软件信息：联系邮件 */
    String P3010206 = "P3010206";
    int P3010206_SIZE = 256;
    /** 软件信息：链接地址 */
    String P3010207 = "P3010207";
    int P3010207_SIZE = 1024;
    /** 软件信息：兼容后缀 */
    String P3010208 = "P3010208";
    int P3010208_SIZE = 2048;
    /** 软件信息：软件描述 */
    String P3010209 = "P3010209";
    int P3010209_SIZE = 2048;
    /** 软件信息：附注信息 */
    String P301020A = "P301020A";
    int P301020A_SIZE = 2048;
    /** 软件信息：更新日期 */
    String P301020B = "P301020B";
    /** 软件信息：创建日期 */
    String P301020C = "P301020C";
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    // 文件信息
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    /** 文件信息 */
    String P3010300 = "P3010300";
    /** 文件信息：显示排序 */
    String P3010301 = "P3010301";
    /** 文件信息：文件索引 */
    String P3010302 = "P3010302";
    int P3010302_SIZE = 16;
    /** 文件信息：软件索引 */
    String P3010303 = "P3010303";
    int P3010303_SIZE = 16;
    /** 文件信息：文件图标 */
    String P3010304 = "P3010304";
    int P3010304_SIZE = 16;
    /** 文件信息：签名字符 */
    String P3010305 = "P3010305";
    int P3010305_SIZE = 256;
    /** 文件信息：签名数值 */
    String P3010306 = "P3010306";
    int P3010306_SIZE = 256;
    /** 文件信息：偏移位置 */
    String P3010307 = "P3010307";
    /** 文件信息：加密算法 */
    String P3010308 = "P3010308";
    int P3010308_SIZE = 256;
    /** 文件信息：起始数据 */
    String P3010309 = "P3010309";
    int P3010309_SIZE = 512;
    /** 文件信息：结束数据 */
    String P301030A = "P301030A";
    int P301030A_SIZE = 512;
    /** 文件信息：附注信息 */
    String P301030B = "P301030B";
    int P301030B_SIZE = 2048;
    /** 文件信息：更新日期 */
    String P301030C = "P301030C";
    /** 文件信息：创建日期 */
    String P301030D = "P301030D";
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    // 文档格式
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    /** 文档格式 */
    String P3010400 = "P3010400";
    /** 文档格式：显示排序 */
    String P3010401 = "P3010401";
    /** 文档格式：文档索引 */
    String P3010402 = "P3010402";
    int P3010402_SIZE = 16;
    /** 文档格式：语言索引 */
    String P3010403 = "P3010403";
    int P3010403_SIZE = 16;
    /** 文档格式：文档名称 */
    String P3010404 = "P3010404";
    int P3010404_SIZE = 256;
    /** 文档格式：发行版本 */
    String P3010405 = "P3010405";
    int P3010405_SIZE = 32;
    /** 文档格式：发行日期 */
    String P3010406 = "P3010406";
    int P3010406_SIZE = 32;
    /** 文档格式：附注信息 */
    String P3010407 = "P3010407";
    int P3010407_SIZE = 2048;
    /** 文档格式：更新日期 */
    String P3010408 = "P3010408";
    /** 文档格式：创建日期 */
    String P3010409 = "P3010409";
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    // 描述信息
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    /** 描述信息 */
    String P3010500 = "P3010500";
    /** 描述信息：描述索引 */
    String P3010501 = "P3010501";
    int P3010501_SIZE = 16;
    /** 描述信息：语言索引 */
    String P3010502 = "P3010502";
    int P3010502_SIZE = 16;
    /** 描述信息：描述内容 */
    String P3010503 = "P3010503";
    int P3010503_SIZE = 2048;
    /** 描述信息：附注信息 */
    String P3010504 = "P3010504";
    int P3010504_SIZE = 2048;
    /** 描述信息：更新日期 */
    String P3010505 = "P3010505";
    /** 描述信息：创建日期 */
    String P3010506 = "P3010506";
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    // MIME信息
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    /** MIME信息 */
    String P3010600 = "P3010600";
    /** MIME信息：显示排序 */
    String P3010601 = "P3010601";
    /** MIME信息：特别后缀 */
    String P3010602 = "P3010602";
    int P3010602_SIZE = 16;
    /** MIME信息：MIME类型 */
    String P3010603 = "P3010603";
    int P3010603_SIZE = 16;
    /** MIME信息：附注信息 */
    String P3010604 = "P3010604";
    int P3010604_SIZE = 2048;
    /** MIME信息：更新日期 */
    String P3010605 = "P3010605";
    /** MIME信息：创建日期 */
    String P3010606 = "P3010606";
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    // 备选软件
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    /** 备选软件 */
    String P3010700 = "P3010700";
    /** 备选软件：显示排序 */
    String P3010701 = "P3010701";
    /** 备选软件：特别后缀 */
    String P3010702 = "P3010702";
    int P3010702_SIZE = 16;
    /** 备选软件：备选软件 */
    String P3010703 = "P3010703";
    int P3010703_SIZE = 16;
    /** 备选软件：附注信息 */
    String P3010704 = "P3010704";
    int P3010704_SIZE = 2048;
    /** 备选软件：更新日期 */
    String P3010705 = "P3010705";
    /** 备选软件：创建日期 */
    String P3010706 = "P3010706";
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    // 操作平台
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    /** 操作平台 */
    String P3010800 = "P3010800";
    /** 操作平台：显示排序 */
    String P3010801 = "P3010801";
    /** 操作平台：所属家族 */
    String P3010802 = "P3010802";
    /** 操作平台：平台索引 */
    String P3010803 = "P3010803";
    int P3010803_SIZE = 16;
    /** 操作平台：语言索引 */
    String P3010804 = "P3010804";
    int P3010804_SIZE = 16;
    /** 操作平台：平台名称 */
    String P3010805 = "P3010805";
    int P3010805_SIZE = 256;
    /** 操作平台：平台说明 */
    String P3010806 = "P3010806";
    int P3010806_SIZE = 2048;
    /** 操作平台：附注信息 */
    String P3010807 = "P3010807";
    int P3010807_SIZE = 2048;
    /** 操作平台：更新日期 */
    String P3010808 = "P3010808";
    /** 操作平台：创建日期 */
    String P3010809 = "P3010809";
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    // MIME数据
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    /** MIME数据 */
    String P301F100 = "P301F100";
    /** MIME数据：显示排序 */
    String P301F101 = "P301F101";
    /** MIME数据：MIME索引 */
    String P301F102 = "P301F102";
    int P301F102_SIZE = 16;
    /** MIME数据：语言索引 */
    String P301F103 = "P301F103";
    int P301F103_SIZE = 16;
    /** MIME数据：MIME名称 */
    String P301F104 = "P301F104";
    int P301F104_SIZE = 256;
    /** MIME数据：MIME说明 */
    String P301F105 = "P301F105";
    int P301F105_SIZE = 2048;
    /** MIME数据：附注信息 */
    String P301F106 = "P301F106";
    int P301F106_SIZE = 2048;
    /** MIME数据：更新日期 */
    String P301F107 = "P301F107";
    /** MIME数据：创建日期 */
    String P301F108 = "P301F108";
    // ----------------------------------------------------
    // 迷你日历
    // ----------------------------------------------------
    /** 迷你日历 */
    String P3040100 = "P3040100";
    /** 排序依据 */
    String P3040101 = "P3040101";
    /** 提示方式 */
    String P3040102 = "P3040102";
    /** 提示索引 */
    String P3040103 = "P3040103";
    int P3040103_SIZE = 16;
    /** 语言索引 */
    String P3040104 = "P3040104";
    int P3040104_SIZE = 8;
    /** 提示类别 */
    String P3040105 = "P3040105";
    int P3040105_SIZE = 16;
    /** 起始年份 */
    String P3040106 = "P3040106";
    int P3040106_SIZE = 256;
    /** 起始月份 */
    String P3040107 = "P3040107";
    int P3040107_SIZE = 256;
    /** 起始日期 */
    String P3040108 = "P3040108";
    int P3040108_SIZE = 256;
    /** 起始年周 */
    String P3040109 = "P3040109";
    int P3040109_SIZE = 256;
    /** 起始月周 */
    String P304010A = "P304010A";
    int P304010A_SIZE = 256;
    /** 起始时间 */
    String P304010B = "P304010B";
    /** 提示年份 */
    String P304010C = "P304010C";
    int P304010C_SIZE = 256;
    /** 提示月份 */
    String P304010D = "P304010D";
    int P304010D_SIZE = 256;
    /** 提示日期 */
    String P304010E = "P304010E";
    int P304010E_SIZE = 256;
    /** 提示年周 */
    String P304010F = "P304010F";
    int P304010F_SIZE = 256;
    /** 提示月周 */
    String P3040110 = "P3040110";
    int P3040110_SIZE = 256;
    /** 提示时间 */
    String P3040111 = "P3040111";
    /** 结束年份 */
    String P3040112 = "P3040112";
    int P3040112_SIZE = 256;
    /** 结束月份 */
    String P3040113 = "P3040113";
    int P3040113_SIZE = 256;
    /** 结束日期 */
    String P3040114 = "P3040114";
    int P3040114_SIZE = 256;
    /** 结束年周 */
    String P3040115 = "P3040115";
    int P3040115_SIZE = 256;
    /** 结束月周 */
    String P3040116 = "P3040116";
    int P3040116_SIZE = 256;
    /** 结束时间 */
    String P3040117 = "P3040117";
    /** 提示标题 */
    String P3040118 = "P3040118";
    int P3040118_SIZE = 256;
    /** 提示内容 */
    String P3040119 = "P3040119";
    int P3040119_SIZE = 1024;
    /** 详细链接 */
    String P304011A = "P304011A";
    int P304011A_SIZE = 1024;
    /** 附注信息 */
    String P304011B = "P304011B";
    int P304011B_SIZE = 2048;
    /** 更新日期 */
    String P304011C = "P304011C";
    /** 创建日期 */
    String P304011D = "P304011D";
    // ----------------------------------------------------
    // 链接收藏
    // ----------------------------------------------------
    /** 排序依据 */
    String P3070001 = "P3070001";
    /** 使用状态 */
    String P3070002 = "P3070002";
    /** 链接索引 */
    String P3070003 = "P3070003";
    int P3070003_SIZE = 16;
    /** 系统标记 */
    String P3070004 = "P3070004";
    int P3070004_SIZE = 8;
    /** 类别索引 */
    String P3070005 = "P3070005";
    int P3070005_SIZE = 16;
    /** 是否门户 */
    String P3070006 = "P3070006";
    int P3070006_SIZE = 16;
    /** 链接名称 */
    String P3070007 = "P3070007";
    int P3070007_SIZE = 256;
    /** 网站标题 */
    String P3070008 = "P3070008";
    int P3070008_SIZE = 256;
    /** 链接路径 */
    String P3070009 = "P3070009";
    int P3070009_SIZE = 1024;
    /** 关键搜索 */
    String P307000A = "P307000A";
    int P307000A_SIZE = 1024;
    /** 网站描述 */
    String P307000B = "P307000B";
    int P307000B_SIZE = 2048;
    /** 相关说明 */
    String P307000C = "P307000C";
    int P307000C_SIZE = 2048;
    /** 更新日期 */
    String P307000D = "P307000D";
    /** 提交日期 */
    String P307000E = "P307000E";
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    // 分类链接
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    /** 分类链接 */
    String P3070100 = "P3070100";
    /** 类别索引 */
    String P3070101 = "P3070101";
    int P3070101_SIZE = 16;
    /** 链接索引 */
    String P3070102 = "P3070102";
    int P3070102_SIZE = 16;
    /** 相关说明 */
    String P3070103 = "P3070103";
    int P3070103_SIZE = 2048;
    /** 更新日期 */
    String P3070104 = "P3070104";
    /** 创建日期 */
    String P3070105 = "P3070105";
    // ----------------------------------------------------
    // 密码管理
    // ----------------------------------------------------
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    // 用户口令
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    /** 密码管理 */
    String P30F0100 = "P30F0100";
    /** 使用状态 */
    String P30F0101 = "P30F0101";
    /** 排序依据 */
    String P30F0102 = "P30F0102";
    /** 口令索引 */
    String P30F0103 = "P30F0103";
    int P30F0103_SIZE = 16;
    /** 更新日期 */
    String P30F0104 = "P30F0104";
    int P30F0104_SIZE = 16;
    /** 用户索引 */
    String P30F0105 = "P30F0105";
    int P30F0105_SIZE = 8;
    /** 所属类别 */
    String P30F0106 = "P30F0106";
    int P30F0106_SIZE = 16;
    /** 口令标题 */
    String P30F0107 = "P30F0107";
    int P30F0107_SIZE = 256;
    /** 关键搜索 */
    String P30F0108 = "P30F0108";
    int P30F0108_SIZE = 2048;
    /** 口令内容 */
    String P30F0109 = "P30F0109";
    int P30F0109_SIZE = 2048;
    /** 相关说明 */
    String P30F010A = "P30F010A";
    int P30F010A_SIZE = 2048;
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    // 自定义数据
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    /** 定制类别 */
    String P30F0200 = "P30F0200";
    /** 排序依据 */
    String P30F0201 = "P30F0201";
    /** 属性类别 */
    String P30F0202 = "P30F0202";
    /** 属性索引 */
    String P30F0203 = "P30F0203";
    int P30F0203_SIZE = 16;
    /** 类别索引 */
    String P30F0204 = "P30F0204";
    int P30F0204_SIZE = 16;
    /** 属性名称 */
    String P30F0205 = "P30F0205";
    int P30F0205_SIZE = 256;
    /** 属性提示 */
    String P30F0206 = "P30F0206";
    int P30F0206_SIZE = 256;
    /** 属性说明 */
    String P30F0207 = "P30F0207";
    int P30F0207_SIZE = 2048;
    /** 更新日期 */
    String P30F0208 = "P30F0208";
    /** 创建日期 */
    String P30F0209 = "P30F0209";
}
