/*
 * Project:        RMPS
 * Compiler:       JDK1.6.0
 * CopyRight:      &copy; 2007 Amon &reg; Winshine ( Amon@amonsoft.cn / http://amonsoft.cn ).
 * Description:
 *
 */
package cons.comn.user.U0000000;

/**
 * <ul>
 * <li>功能说明：</li>
 * <br />
 * TODO: 功能说明
 * <li>使用说明：</li>
 * <br />
 * TODO: 使用说明
 * </ul>
 * 
 * @author Amon
 */
public interface LangRes
{
    // ========================================================================
    // 5 迷你窗口语言资源
    // ========================================================================
    // ----------------------------------------------------
    // 3 标签语言资源
    // ----------------------------------------------------
    String U0005300 = "U0005300"; // 5
    String U0005301 = "U0005301"; // 用户(&U)
    String U0005302 = "U0005302"; // 登录名称
    String U0005303 = "U0005303"; // 口令(&P)
    String U0005304 = "U0005304"; // 登录口令
    // ----------------------------------------------------
    // 5 按钮语言资源
    // ----------------------------------------------------
    String U0005500 = "U0005500"; // 5
    String U0005501 = "U0005501"; // 取消(&C)
    String U0005502 = "U0005502"; // 取消登录
    String U0005503 = "U0005503"; // 登录(&L)
    String U0005504 = "U0005504"; // 登录系统
    // ----------------------------------------------------
    // A 消息提示语言资源
    // ----------------------------------------------------
    String U0005A00 = "U0005A00"; // 3
    String U0005A01 = "U0005A01"; // 登录名称不能为空！
    String U0005A02 = "U0005A02"; // 登录口令不能为空！
}
